// Написать программу, которая на вход приниамет число и выдает его квадрат

Console.Write("Enter a number: ");
double number = double.Parse(Console.ReadLine());
double number_square = number*number;
Console.Write("The number in square is " + number_square);

