//------------------------------------------------------------------------------------------------------------------------------------------------
//Функции
//------------------------------------------------------------------------------------------------------------------------------------------------
void PrintArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write(array[i] + " ");
    }
    Console.WriteLine();
}

void FillArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().Next(100, 1000);
    }
}

//------------------------------------------------------------------------------------------------------------------------------------------------
//Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве
//------------------------------------------------------------------------------------------------------------------------------------------------
Console.Write("Введите размерность массива: ");
int arraySize = int.Parse(Console.ReadLine());
int[] mass = new int[arraySize];

FillArray(mass);
Console.Write("Созданный массив: ");
PrintArray(mass);

int counter=0;

for (int i = 0; i < mass.Length; i++)
{
    if (mass[i]%2 == 0)
    {
        counter++;
    }       
}

Console.Write($"Количество четных чисел в вашем массиве: {counter}.");

//-----------------------------------------------------------------------------------------------------------------
// Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.
//-----------------------------------------------------------------------------------------------------------------
Console.Write("Введите размерность массива: ");
int arraySize = int.Parse(Console.ReadLine());
int[] mass = new int[arraySize];

FillArray(mass);
Console.Write("Созданный массив: ");
PrintArray(mass);

int SumNotEven=0;

for (int i = 0; i < mass.Length; i+=2)
{
    SumNotEven+=mass[i];
}

Console.Write($"Сумма чисел стоящих на нечетных местах: {SumNotEven}.");

//-------------------------------------------------------------------------------------------------------
// Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
//-------------------------------------------------------------------------------------------------------
Console.Write("Введите размерность массива: ");
int arraySize = int.Parse(Console.ReadLine());
double [] mass = new double[arraySize];

FillArray(mass);
Console.Write("Созданный массив: ");
PrintArray(mass);

int minidx = 0;
double minval = mass[0];
int maxidx = 0;
double maxval = mass[0];

for (int i=0; i<mass.Length; i++)
{
    if (mass[i]<minval)
    {
        minval=mass[i];    
    }
    if (mass[i]>maxval)
    {
        maxval=mass[i];    
    }
}
double diffMaxMin=maxval-minval;
Console.WriteLine($"Разность между max {maxval} и min {minval} элементами массива mass равна " + diffMaxMin);